chat_system_1298178940_actor_description=Torn Digor. Dwarves' king.
chat_system_1298178940_snap_0_question=^?^Good day, [player]! What brings you to my castle?
chat_system_1298178940_snap_0_answer_0=^?^I come here from Ellinia with a message from the queen of the elves. She has a request for you. Here is the letter!
chat_system_1298178940_snap_0_answer_1=^?^I wanted to ask how can I get to Mehgard.
chat_system_1298178940_snap_0_answer_2=^?^The necromancers' revolt... How did it affect the dwarves?
chat_system_1298178940_snap_0_header_2=^?^It was horrible time... The necromancers couldn't get us, but the plague cast by them killed a lot of dwarves. You see, our people are tightly knit, so the disease spread immediately, whole cities died out, all the people, dead. Those who had not died wished they had, when their dead brothers and sisters rose from their graves. Just imagine it, [player], entire cities of undead dwarven corpses, rising up to destroy the survivors! With tears in their eyes, the dwarves struggled against their fallen friends and family, cut them to shreads with pole-axes, shot them with cannons, burned them with fire and acid...<br>Since then we don't like undead creatures very much.
chat_system_1298178940_snap_1_question=^?^[s]The dwarven king takes the letter and begins to read.[/s]<br>Well-well... Violetta asks for our help in opening the Labyrinth, which was locked by our engineers long ago. And here she writes of the disasters, which grip the elven lands..<br>[s]Torn Digor becomes silent and looks into the lines attentively. His face turning purple:[/s] <br>Orcs! By a thousand demons, human - it's those damned orcs again!!! They offered a grand engineering project to us, so I sent them to Mehgard. I don't know what happened there, but the orcs killed all the guards and forcibly kidnapped our engineers. When I learned of this, I mobilized our best troops to overtake them, but the orcs retreated into the forbidden caves, to the Portal - and opened it.<br>And when demons poured forth from the Portal, we forgot about the orcs, and they escaped with the captured engineers... So, it turns out that it was not only our country which they threw to the demons to be torn to pieces - but they have thrown Ellinia to the undead army!
chat_system_1298178940_snap_1_answer_0=^?^Well, the kidnapping of Princess Amelie was also their job. To find her, I need the key for the Dragons' Labyrinth.
chat_system_1298178940_snap_2_question=^?^Yes, yes, the labyrinth... Of course, I remember elves once asked us to lock some mad dragons in the mountains...<br>Of course, we didn't help them for free. Our masters from Mehgard locked the Labyrinth the same way as they had locked the Magic Portal a thousand years ago - by special locks with complex mechanisms.<br>So you need to get to Mehgard and talk to the Chief Engineer. He'll tell you how to open the Labyrinth.
chat_system_1298178940_snap_2_answer_0=^?^Thank you, Your Majesty!
chat_system_1298178940_snap_2_answer_1=^?^And how can I get to the Mehgard?
chat_system_1298178940_snap_3_question=^?^To Mehgard? Have you not been there? No? Well. You should take a locomotive. This is one of our greatest inventions - a self-propelled carriage! Get down into the mines, go to the north-east and then up the elevator. There should be a sign at the station. There's no other way to Mehgard right now. In some years we will have railroad stretching to every corner of our country!
chat_system_1298178940_snap_3_answer_0=^?^Thank you for the explanation. Goodbye!
